# Làm sạch đữ liệu cơ bản

## 1. Tạo dữ liệu

In [21]:
import pandas as pd  
data ={
    "Id": [1, 2, 3, 4, 5],
    "Name": ["Anh", "Em", "Phong", "Phú", None],
    "Age": [15, 14, 18, 28, 50],
    "Email": ["anh@vlu.edu.vn", "em@gmail.com", "phong@vanlanguni.vn", "phu@yahoo.com", None],
    "Salary": [None, 70000, 10000, 250000, 15000]
}
df = pd.DataFrame(data)
print(df)

   Id   Name  Age                Email    Salary
0   1    Anh   15       anh@vlu.edu.vn       NaN
1   2     Em   14         em@gmail.com   70000.0
2   3  Phong   18  phong@vanlanguni.vn   10000.0
3   4    Phú   28        phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [22]:
# lấy ra 5 dòng đầu tiên
df.head()

   Id   Name  Age                Email    Salary
0   1    Anh   15       anh@vlu.edu.vn       NaN
1   2     Em   14         em@gmail.com   70000.0
2   3  Phong   18  phong@vanlanguni.vn   10000.0
3   4    Phú   28        phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [23]:
#kiểm tra dữ liệu thiếu
df.isnull().sum()

Id        0
Name      1
Age       0
Email     1
Salary    1
dtype: int64

In [25]:
#Điền giá trị thiếu bằng giá trị trung bình cho cụm salary
df["Salary"].fillna(df["Salary"].mean(), inplace = True)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_4756\286716539.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salary"].fillna(df["Salary"].mean(), inplace = True)

In [26]:
#điền giá trị thiếu bằng Unknow cho cột "Name" và cột "Email" 
df["Name"].fillna("Unknow", inplace = True)

df["Email"].fillna("Unknow", inplace = True)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_4756\1477559792.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("Unknow", inplace = True)
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_4756\1477559792.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Email"].fillna("Unknow", inplace = True)

In [28]:
#kiểm tra dữ liệu thiếu
df.isnull().sum()

Id        0
Name      0
Age       0
Email     0
Salary    0
dtype: int64

In [30]:
#loại bỏ dữ trùng lặp
df.drop_duplicates(inplace = True)
df

   Id    Name  Age                Email    Salary
0   1     Anh   15       anh@vlu.edu.vn   86250.0
1   2      Em   14         em@gmail.com   70000.0
2   3   Phong   18  phong@vanlanguni.vn   10000.0
3   4     Phú   28        phu@yahoo.com  250000.0
4   5  Unknow   50               Unknow   15000.0

In [31]:
# chuẩn hóa cột name bằng cách viết hoa chữ cái đầu
df["Name"] = df["Name"].str.title()
df

   Id    Name  Age                Email    Salary
0   1     Anh   15       anh@vlu.edu.vn   86250.0
1   2      Em   14         em@gmail.com   70000.0
2   3   Phong   18  phong@vanlanguni.vn   10000.0
3   4     Phú   28        phu@yahoo.com  250000.0
4   5  Unknow   50               Unknow   15000.0

In [32]:
#Chuẩn hóa cột email bằng cách chuyển về chữ thường
df["Email"] = df["Email"].str.lower()
df

   Id    Name  Age                Email    Salary
0   1     Anh   15       anh@vlu.edu.vn   86250.0
1   2      Em   14         em@gmail.com   70000.0
2   3   Phong   18  phong@vanlanguni.vn   10000.0
3   4     Phú   28        phu@yahoo.com  250000.0
4   5  Unknow   50               unknow   15000.0

In [33]:
#Lưu dữ liệu đẫ làm sạch
df.to_csv("Dulieulamsach.csv", index = False)

# Bài tập về nhà

### Cho dữ liệu dirty_data.csv

1. kiểm tra dữ liệu bị thiếu
    - kiểm tra các cột có dữ liệu thiếu
    - điền giá trị phù hợp hoặc loại bỏ các hàng có quá nhiều dữ liệu thiếu
2. Phát thiện và sửa lỗi dữ liệu bất thường 
    - Tìm các giá trị bất thường trong cột tuổi(age) có thể là âm hoặc quá lớn
    - kiểm tra cột thu nhập( income) để phát hiện dữ liệu bị sai 
3. Chuẩn hóa dạng dữ liệu
    - Chuyển đổi cột ngày sinh về dạng cchuaanr yyyy-mm-đ
    - Chuẩn hóa dữ liệu trong cột giới tính(gender) để chỉ có 2 giới tính hợp lệ "Male" và "Female"
4. xóa bỏ dữ liệu trùng lặp
    - xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng 
5. Xuất dữ liệu sạch
    - Lưu dữ liệu đã làm sạch thành tệp mới clean_data.csv

In [35]:
import pandas as pd 
df = pd.read_csv('D:\train python\Newbie_PhantichGiuLieu_HocMay\dirty_data.csv')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 15-16: malformed \N character escape (967132725.py, line 2)